const _data = {
  血压: [
    "01 - 归零超时 - (操作建议以SDK返回为准)",
    "02 - 周围杂讯太多干扰 - (操作建议以SDK返回为准)",
    "03 - 测量失败 - (操作建议以SDK返回为准)",
    "04 - 袖带佩戴异常 - (操作建议以SDK返回为准)",
    "05 - 测量错误 - (操作建议以SDK返回为准)",
    "06 - 测量错误 - (操作建议以SDK返回为准)",
    "07 - 电量不足 - (操作建议以SDK返回为准)",
    "08 - 未能检测到压力值 - (操作建议以SDK返回为准)",
    "11 - 测量压力超过设定保护点 - (操作建议以SDK返回为准)",
  ],
  三合一: [
    "03 - 存储数据读取错误 - (操作建议以SDK返回为准)",
    "04 - 存储数据上传错误 - (操作建议以SDK返回为准)",
    "23 - 使用错误试纸;①试纸不匹配;②插错插孔;③错误操作，先吸血再插的试纸。;②将未吸过血的试纸正面朝上，按箭头方向插入试纸孔。;如还未能解决，请点击“去咨询”联系客服。 - (操作建议以SDK返回为准)",
    "24 - 试纸不匹配或已失效 - (操作建议以SDK返回为准)",
    "54 - 环境温度超出使用范围 - (操作建议以SDK返回为准)",
    "45 - 测量中操作中断 - (操作建议以SDK返回为准)",
    "62 - 储存数据出错 - (操作建议以SDK返回为准)",
    "77 - 多功能测试仪与检测助手连接不当 - (操作建议以SDK返回为准)",
  ],
  三合一ID: ["0x10 - 血糖", "0x40 - 尿酸", "0x50 - 血酮"],
  血脂: [
    "129 - 用户中断测试 - (操作建议以SDK返回为准)",
    "130 - 测试完成用户拨出测试卡 - (操作建议以SDK返回为准)",
    "131 - 滴血不足 - (操作建议以SDK返回为准)",
    "132 - 系统计算出错 - (操作建议以SDK返回为准)",
    "133 - 测试中用户拨出测试卡 - (操作建议以SDK返回为准)",
    "00 - 试纸不匹配 - (操作建议以SDK返回为准)",
    "01 - 未检测到纸条 - (操作建议以SDK返回为准)",
    "02 - 无效试纸 - (操作建议以SDK返回为准)",
    "03 - 用过的试纸 - (操作建议以SDK返回为准)",
    "04 - 代码卡与试条不符 - (操作建议以SDK返回为准)",
    "05 - 测试完成 - (操作建议以SDK返回为准)",
    "06 - 暂无 Code 信息 - (操作建议以SDK返回为准)",
    "07 - Code 设置成功 - (操作建议以SDK返回为准)",
    "250 - 提前结束了 - (操作建议以SDK返回为准)",
    "251 - 测试超时完成 - (操作建议以SDK返回为准)",
    "252 - 用户中断了 - (操作建议以SDK返回为准)",
    "253 - 测试中用户拨出测试卡 - (操作建议以SDK返回为准)",
  ],
  血脂消息: [
    "00 - 正在等待滴血 - (操作建议以SDK返回为准)",
    "01 - 正在检测滴血量 - (操作建议以SDK返回为准)",
    "02 - 滴血完成 - (操作建议以SDK返回为准)",
    "03 - 滴血不足（血脂） - (操作建议以SDK返回为准)",
  ],
};

export const checkErrorData = (checkName: string) => {
  if (checkName.length == 0) return "--";
  return _data[checkName].join("<br/>");
};
