const _data = {
  血压: [
    "01 - 归零超时 - (①归零时保持袖带不动\n" +
      "②如连续频繁出现，请返厂检查\n" +
      "请点击下方视频或前往“去咨询”联系客服)",
    "02 - 周围杂讯太多干扰 - (因周围杂讯太多，无法测到设备中电压信号，请换个地方重新操作。\n" +
      "如还未能解决，请点击“去咨询”联系客服)",
    "03 - 测量失败 - (臂带是否佩戴正确，若连续三次出现以上问题，请点击下方视频或前往“去咨询”联系客服)",
    "04 - 袖带佩戴异常 - (①调整袖带,松紧度绑好后刚好可插入两根手指为宜,袖带气管口保持在手肘窝上2cm位置。\n" +
      "②连续测量，请重新插臂带气嘴（排余气）\n" +
      "如还未能解决，请点击“去咨询”联系客服。)",
    "05 - 测量错误 - (请休息2分钟,调整袖带,测量过程保持安静,不要移动和说话。\n" +
      "请点击“去咨询”联系客服。)",
    "06 - 测量错误 - (请休息2分钟,调整袖带,测量过程保持安静,不要移动和说话。\n" +
      "请点击“去咨询”联系客服。)",
    "07 - 电量不足 - (请充完电后再使用。温馨提示：使用电压为3.6V±0.2V的适配器充电。\n" +
      "如还未能解决，请点击“去咨询”联系客服。)",
    "08 - 未能检测到压力值 - (请检查臂带是否紧密贴合或确认蓝牙连接状态)",
    "11 - 测量压力超过设定保护点 - (请检查臂带是否紧密贴合. 稍后再次测量血压)",
  ],
  三合一: [
    "03 - 存储数据读取错误 - (数据传输失败。请重新操作。\n" +
      "如还未能解决，请点击“去咨询”联系客服。)",
    "04 - 存储数据上传错误 - (数据传输失败。请重新操作。\n" +
      "如还未能解决，请点击“去咨询”联系客服。)",
    "23 - 使用错误试纸;①试纸不匹配;②插错插孔;③错误操作，先吸血再插的试纸。;②将未吸过血的试纸正面朝上，按箭头方向插入试纸孔。;如还未能解决，请点击“去咨询”联系客服。 - (①请核对试纸型号\n" +
      "②将未吸过血的试纸正面朝上，按箭头方向插入试纸孔。\n" +
      "如还未能解决，请点击“去咨询”联系客服。)",
    "24 - 试纸不匹配或已失效 - (①请核对试纸型号\n" +
      "②请核对试纸保质期，更换新试纸测试。\n" +
      "如还未能解决，请点击“去咨询”联系客服。)",
    "54 - 环境温度超出使用范围 - (请将仪器放置在5-40℃室温下静止20分钟，再使用。 \n" +
      "如还未能解决，请点击“去咨询”联系客服。)",
    "45 - 测量中操作中断 - (测试中，切勿拔出试纸。请更换试纸重新测量。\n" +
      "如还未能解决，请点击“去咨询”联系客服。)",
    "62 - 储存数据出错 - (数据传输失败。请重新操作。\n" +
      "如还未能解决，请点击“去咨询”联系客服。)",
    "77 - 多功能测试仪与检测助手连接不当 - (请拔掉多功能测试仪，8秒后再插入使用。\n" +
      "如还未能解决，请点击“去咨询”联系客服。)",
  ],
  三合一ID: ["0x10 - 血糖", "0x40 - 尿酸", "0x50 - 血酮"],
  血脂: [
    "129 - 用户中断测试 - (测试中，切勿按任何按键中断测试，请换新测试卡测试。\n" +
      "如还未能解决，请点击“去咨询”联系客服。)",
    "130 - 测试完成用户拨出测试卡 - (请更换测试卡继续测量。\n" +
      "如还未能解决，请点击“去咨询”联系客服。)",
    "131 - 滴血不足 - (滴血时，一定要充足，请换新测试卡测试。\n" +
      "请点击下方视频或前往“去咨询”联系客服)",
    "132 - 系统计算出错 - (请更换测试卡重新测量。\n" +
      "如还未能解决，请点击“去咨询”联系客服。)",
    "133 - 测试中用户拨出测试卡 - (请更换测试卡重新测量。如还未能解决，请点击“去咨询”联系客服。)",
    "00 - 试纸不匹配 - (请插入新匹配试纸)",
    "01 - 未检测到纸条 - (请插入试纸)",
    "02 - 无效试纸 - (请插入新试纸)",
    "03 - 用过的试纸 - (请插入新试纸)",
    "04 - 代码卡与试条不符 - (请核对密码)",
    "05 - 测试完成 - (请拔出外挂)",
    "06 - 暂无 Code 信息 - (请插入对码卡, 或者使用百合医App扫描对码)",
    "07 - Code 设置成功 - (请重新获取新Code)",
    "250 - 提前结束了 - (测试完成后的提示)",
    "251 - 测试超时完成 - (请更换测试卡继续测试)",
    "252 - 用户中断了 - (用户中断了)",
    "253 - 测试中用户拨出测试卡 - (请更换测试卡重新测量。如还未能解决，请点击“去咨询”联系客服。)",
  ],
  血脂消息: [
    "00 - 正在等待滴血 - (操作建议以SDK返回为准)",
    "01 - 正在检测滴血量 - (操作建议以SDK返回为准)",
    "02 - 滴血完成 - (操作建议以SDK返回为准)",
    "03 - 滴血不足（血脂） - (操作建议以SDK返回为准)",
  ],
};

export const checkErrorData = (checkName: string) => {
  if (checkName.length == 0) return "--";
  return _data[checkName].join("<br/><br/>");
};
